`timescale 1ns / 1ps

module static_digital_display #(

    //================================================================
    // 可选参数
    //================================================================

    // 数码管位数
    parameter [7:0] DIGITS_NUM = 4,

    //================================================================
    // 自动计算参数
    //================================================================

    // 位选输入位宽
    parameter SEL_WIDTH = (DIGITS_NUM == 1) ? 1 : clog2(DIGITS_NUM)

) (

    //================================================================
    // 模块输入
    //================================================================

    // 段选信号, 最高位为高有效空白标志位
    input  wire [4:0] data_in,
    // 位选信号，当 DIGITS_NUM = 1 时无效
    input  wire [SEL_WIDTH-1:0] dig_sel,

    //================================================================
    // 模块输出
    //================================================================

    // 共阴极(高有效)段选输出
    output reg  [6:0] seg_out,
    // 低有效位使能输出
    output reg  [DIGITS_NUM-1:0] dig_out

);

    //================================================================
    // 函数声明
    //================================================================

    // 计算 log2 函数
    function integer clog2;
        input [7:0] value;
        reg   [7:0] value_minus_one;
        begin
            value_minus_one = value - 1'b1;
            for (clog2 = 0; value_minus_one > 0; clog2 = clog2 + 1) begin
                value_minus_one = value_minus_one >> 1;
            end
        end
    endfunction

    //================================================================
    // 组合逻辑
    //================================================================

    // 段选信号
    always @(*) begin
        case (data_in)
            5'd0:    seg_out = 7'b0111111;  // 显示 "0"
            5'd1:    seg_out = 7'b0000110;  // 显示 "1"
            5'd2:    seg_out = 7'b1011011;  // 显示 "2"
            5'd3:    seg_out = 7'b1001111;  // 显示 "3"
            5'd4:    seg_out = 7'b1100110;  // 显示 "4"
            5'd5:    seg_out = 7'b1101101;  // 显示 "5"
            5'd6:    seg_out = 7'b1111101;  // 显示 "6"
            5'd7:    seg_out = 7'b0000111;  // 显示 "7"
            5'd8:    seg_out = 7'b1111111;  // 显示 "8"
            5'd9:    seg_out = 7'b1101111;  // 显示 "9"
            5'd10:   seg_out = 7'b1110111;  // 显示 "A"
            5'd11:   seg_out = 7'b1111100;  // 显示 "b"
            5'd12:   seg_out = 7'b0111001;  // 显示 "C"
            5'd13:   seg_out = 7'b1011110;  // 显示 "d"
            5'd14:   seg_out = 7'b1111001;  // 显示 "E"
            5'd15:   seg_out = 7'b1110001;  // 显示 "F"
            default: seg_out = 7'b0000000;  // 空白显示
        endcase
    end

    // 位使能信号
    always @(*) begin
        if (DIGITS_NUM == 1) begin
            // 只有一位数码管时
            dig_out = 1'b0;
        end else begin
            // 多位数码管时
            dig_out = ~( {{(DIGITS_NUM-1){1'b0}}, 1'b1} << dig_sel );
        end
    end

endmodule