`timescale 1ns / 1ps

module mux_2bit #(
    //================================================================
    // 可选参数
    //================================================================

    // 数据位宽，单位为 bit
    parameter [7:0] DATA_WIDTH = 1
    
) (
    //================================================================
    // 模块输入
    //================================================================

    // 二进制编码选择信号
    input  wire [1:0] sel,

    // 输入数据
    input  wire [DATA_WIDTH - 1:0] data_in_0,
    input  wire [DATA_WIDTH - 1:0] data_in_1,
    input  wire [DATA_WIDTH - 1:0] data_in_2,
    input  wire [DATA_WIDTH - 1:0] data_in_3,

    //================================================================
    // 模块输出
    //================================================================

    // 选中的输出数据
    output reg  [DATA_WIDTH - 1:0] data_out
    
);

    //================================================================
    // 组合逻辑
    //================================================================

    always @(*) begin
        case (sel)
            2'h0:    data_out = data_in_0;
            2'h1:    data_out = data_in_1;
            2'h2:    data_out = data_in_2;
            2'h3:    data_out = data_in_3;
            default: data_out = {DATA_WIDTH{1'b0}};
        endcase
    end

endmodule
