`timescale 1ns / 1ps

//================================================================
// 模块说明
//================================================================
// 8 选 1 多路选择器。
// 基于 3 位选择信号从八路输入中选取一路输出。
// 支持参数化数据位宽。
//================================================================

module mux_3bit #(
    //================================================================
    // 可选参数
    //================================================================

    // 数据位宽，单位为 bit
    parameter [7:0] DATA_WIDTH = 1
    
) (
    //================================================================
    // 模块输入
    //================================================================

    // 二进制编码选择信号
    input  wire [2:0] sel,

    // 输入数据
    input  wire [DATA_WIDTH - 1:0] data_in_0,
    input  wire [DATA_WIDTH - 1:0] data_in_1,
    input  wire [DATA_WIDTH - 1:0] data_in_2,
    input  wire [DATA_WIDTH - 1:0] data_in_3,
    input  wire [DATA_WIDTH - 1:0] data_in_4,
    input  wire [DATA_WIDTH - 1:0] data_in_5,
    input  wire [DATA_WIDTH - 1:0] data_in_6,
    input  wire [DATA_WIDTH - 1:0] data_in_7,

    //================================================================
    // 模块输出
    //================================================================

    // 选中的输出数据
    output reg  [DATA_WIDTH - 1:0] data_out

);

    //================================================================
    // 组合逻辑
    //================================================================

    always @(*) begin
        case (sel)
            3'h0:    data_out = data_in_0;
            3'h1:    data_out = data_in_1;
            3'h2:    data_out = data_in_2;
            3'h3:    data_out = data_in_3;
            3'h4:    data_out = data_in_4;
            3'h5:    data_out = data_in_5;
            3'h6:    data_out = data_in_6;
            3'h7:    data_out = data_in_7;
            default: data_out = {DATA_WIDTH{1'b0}};
        endcase
    end

endmodule
