`timescale 1ns / 1ps

//================================================================
// 模块说明
//================================================================
// 时钟分频器。
// 通过计数器翻转法实现偶数分频，输出 50% 占空比的分频时钟。
//================================================================

module clock_divider #(
    //================================================================
    // 可选参数
    //================================================================

    // 分频系数位宽，范围 1 ~ 64，单位为 bit
    parameter [7:0]  DIV_WIDTH  = 32

) (
    //================================================================
    // 模块输入
    //================================================================

    // 系统时钟
    input  wire clk,
    // 高电平有效异步复位
    input  wire rst,
    
    // f_out = f_clk / (2 * div_value)
    // 分频系数设置为 0 时分频输出时钟保持输出低电平

    // 分频系数，表示每次输出翻转所需的时钟周期数
    input  wire [DIV_WIDTH - 1:0] div_value,

    //================================================================
    // 模块输出
    //================================================================

    // 分频输出时钟
    output reg  clk_out
);

    //================================================================
    // 寄存器声明
    //================================================================

    // 当前计数值
    reg [DIV_WIDTH - 1:0] cnt_current;

    //================================================================
    // 时序逻辑
    //================================================================

    always @(posedge clk or posedge rst) begin
        if (rst) begin
            // 复位时
            clk_out <= 1'b0;
            cnt_current <= {DIV_WIDTH{1'b0}};
        end else if (div_value == {DIV_WIDTH{1'b0}}) begin
            // 分频系数设置为 0 时
            clk_out <= 1'b0;
            cnt_current <= {DIV_WIDTH{1'b0}};
        end else if (cnt_current == div_value - 1'b1) begin
            // 计数器计数到目标计数值时
            clk_out <= ~clk_out;
            cnt_current <= {DIV_WIDTH{1'b0}};
        end else begin
            // 计数器正常计数时
            cnt_current <= cnt_current + 1'b1;
        end
    end

endmodule
